{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and stock item CRUD with role checks and time-stamped inventory updates.",
  "feature_evidence.json": "Feature evidence report linking app features to source files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing frontend files, their purposes, and recent feature additions.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, dark mode values, and global background/foreground styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React entry component that shows a loading screen, login screen, or stock register depending on identity state.",
  "frontend/src/features/auth/LoginScreen.tsx": "UI for Internet Identity login with error handling, loading states, and branded layout.",
  "frontend/src/features/stock-register/components/DateNavigator.tsx": "Date navigation component with month, year, and day selectors using getDaysInMonth for accurate month lengths.",
  "frontend/src/features/stock-register/components/RegisterActionsBar.tsx": "UI bar providing add, print, export, and layout selection controls for the stock register.",
  "frontend/src/features/stock-register/components/StockRegisterGrid.tsx": "Editable table for stock register rows with inputs, formatting, and optional print‑only mode.",
  "frontend/src/features/stock-register/dateUtils.ts": "Utility functions for timezone‑safe parsing, formatting, and comparison of YYYY‑MM‑DD dates.",
  "frontend/src/features/stock-register/export/exportXlsx.ts": "Generates CSV files for row or matrix layouts and triggers file download with proper formatting.",
  "frontend/src/features/stock-register/gridMath.ts": "Provides basic numeric calculations and formatting helpers for stock register fields.",
  "frontend/src/features/stock-register/monthlyMatrix/monthlyMatrix.ts": "Builds day‑by‑day matrix structures and CSV rows from register rows, including item grouping.",
  "frontend/src/features/stock-register/monthlyMatrix/MonthlyMatrixTable.tsx": "Renders a matrix table showing daily stock data per item with grouped column headers.",
  "frontend/src/features/stock-register/print/PrintView.tsx": "Print‑optimized view that displays either the row grid or matrix layout with header details.",
  "frontend/src/features/stock-register/state/useRegisterFilters.ts": "React hook managing selected year, month, and focused day for register filtering.",
  "frontend/src/features/stock-register/StockRegisterPage.tsx": "Main stock register UI handling filters, row/matrix layouts, printing, Excel export, and logout logic.",
  "frontend/src/features/stock-register/types.ts": "Type definitions for register rows, filters, and layout modes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for managing Internet Identity authentication, including login, logout, and identity persistence. Wraps AuthClient with custom options and exposes login state helpers.",
  "frontend/src/index.css": "Configures Tailwind base, theme variables, dark mode palettes, global styles, and detailed print formatting rules. Establishes CSS variables for consistent theming.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider. Imports global styles and renders App into the root element.",
  "frontend/src/types/xlsx.d.ts": "TypeScript declaration file providing type definitions for the xlsx module's workbook, sheets, utilities, and read/write functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and sessionStorage values, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, container settings, fonts, animations, and dark mode support using CSS variables.",
  "project_state.json": "Holds project metadata, feature definitions, and pending feature requests related to authentication and backend access control."
}