{
  "kind": "build_request",
  "title": "Add Internet Identity login page and gate app access",
  "projectName": "Stock Register",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Create a dedicated login screen that allows users to sign in using Internet Identity before accessing the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Website Ulla poga login page create pandriya"
        ]
      },
      "acceptanceCriteria": [
        "When the user is not authenticated, the app shows a full-page Login screen instead of the Stock Register UI.",
        "Login screen has a clear primary action labeled in English (e.g., \"Sign in with Internet Identity\") that triggers Internet Identity login via the existing authentication hook.",
        "Login screen shows a visible loading state while login is in progress and shows a readable error message if login fails (English text)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Gate the existing Stock Register UI behind authentication by updating the top-level app rendering to show the Login screen when no identity is present and show the existing StockRegisterPage only after successful authentication.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Website Ulla poga login page create pandriya"
        ]
      },
      "acceptanceCriteria": [
        "After a successful Internet Identity login, the app automatically transitions from the Login screen to the existing Stock Register page without a manual refresh.",
        "On page reload, if a valid stored identity exists, the app skips the Login screen and shows the Stock Register page.",
        "No edits are made to immutable authentication hook files; changes are implemented by composing existing hooks/components."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add a logout control in the authenticated UI that clears the Internet Identity session and returns the user to the Login screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Website Ulla poga login page create pandriya"
        ]
      },
      "acceptanceCriteria": [
        "When authenticated, a visible logout control (English label, e.g., \"Logout\") is available in the app UI.",
        "Clicking logout clears the identity using the existing authentication context and returns the user to the Login screen."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Restrict backend write operations to authenticated callers by rejecting anonymous principals for add/update/remove operations.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Website Ulla poga login page create pandriya"
        ]
      },
      "acceptanceCriteria": [
        "Calls to addStockItem/updateStockItem/removeStockItem from an anonymous caller are rejected with a clear trap/error message.",
        "Calls from authenticated callers continue to work as before.",
        "Query methods (getStockItem/getAllStockItems) remain callable (no new auth restriction) unless required by the existing actor patterns."
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose these modules from new/other components instead.",
    "Backend must remain a single Motoko actor with logic in backend/main.mo; only add migration.mo if state schema/state handling changes (not required for auth checks alone).",
    "Use English for any user-facing text added to the UI (labels, buttons, error messages)."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity is allowed).",
    "Do not implement role-based access control or admin/user permissions beyond basic authenticated vs anonymous gating.",
    "Do not add routing/navigation overhaul unless required to show the login screen."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}