{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Internet Identity login screen and authenticated gating for Stock Register",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Add a dedicated full-page Login screen that signs in via the existing Internet Identity hook, with loading and error states.",
      "acceptanceCriteria": [
        "When the user is not authenticated, the app shows a full-page Login screen instead of the Stock Register UI.",
        "Login screen has a clear primary action labeled in English (e.g., \"Sign in with Internet Identity\") that triggers Internet Identity login via the existing authentication hook.",
        "Login screen shows a visible loading state while login is in progress and shows a readable error message if login fails (English text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/auth/LoginScreen.tsx",
          "operation": "create",
          "description": "Create a full-page LoginScreen component that composes the existing useInternetIdentity hook (without modifying it) to: trigger login on user interaction, render a primary English-labeled sign-in button, show a disabled/loading UI while logging in, and render a readable English error message using the hook's loginError/isLoginError state."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Gate the Stock Register UI by conditionally rendering Login vs StockRegisterPage at the top level based on identity state.",
      "acceptanceCriteria": [
        "After a successful Internet Identity login, the app automatically transitions from the Login screen to the existing Stock Register page without a manual refresh.",
        "On page reload, if a valid stored identity exists, the app skips the Login screen and shows the Stock Register page.",
        "No edits are made to immutable authentication hook files; changes are implemented by composing existing hooks/components."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the top-level App rendering to compose useInternetIdentity and conditionally render: (1) an optional full-page initializing state while identity is being restored, (2) LoginScreen when identity is absent, and (3) the existing StockRegisterPage only when identity is present; wire the new LoginScreen into the app by importing and using it here."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add a visible Logout control in the authenticated Stock Register UI that clears the identity session and returns to the Login screen.",
      "acceptanceCriteria": [
        "When authenticated, a visible logout control (English label, e.g., \"Logout\") is available in the app UI.",
        "Clicking logout clears the identity using the existing authentication context and returns the user to the Login screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/stock-register/StockRegisterPage.tsx",
          "operation": "modify",
          "description": "Add a clearly visible English-labeled \"Logout\" control to the authenticated UI (e.g., in the header area) that composes useInternetIdentity.clear() to end the session; also clear cached client state (e.g., via React Query's QueryClient) so the app cleanly returns to the Login screen when identity becomes undefined."
        }
      ]
    }
  ]
}